{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "semantic",
    "1": "spelling",
    "2": "grammar",
    "3": "redundant",
    "4": "duplication",
    "5": "incoherent",
    "6": "punctuation",
    "7": "wrong slot",
    "8": "slot addition",
    "9": "slot omission",
    "10": "wordy",
    "11": "answering",
    "12": "questioning",
    "13": "homonym",
    "14": "acronym",
    "15": "correct"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "acronym": 14,
    "answering": 11,
    "correct": 15,
    "duplication": 4,
    "grammar": 2,
    "homonym": 13,
    "incoherent": 5,
    "punctuation": 6,
    "questioning": 12,
    "redundant": 3,
    "semantic": 0,
    "slot addition": 8,
    "slot omission": 9,
    "spelling": 1,
    "wordy": 10,
    "wrong slot": 7
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "multi_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.27.4",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
